/*
    色彩集

    说明：
        主要基于《element ui》与《Flat UI Colors》的色彩约定

    备注：
        约定
            文字默认    black100
            次级文字    black80
            主要边框    black60
            一般边框    black40
            次级边框    black20
            测试用阴影    shadow20

*/
/*************************************************************************************************/
// jshint esversion: 6


export default
{
    // 1.Element-UI 品牌色 /////////////////////////////////////////////////////////////////////////////
    $element_blue       : "#1890FF",     //    element品牌色是#409EFF。而#1890FF其实是ant'd的品牌色

    // 2.Element-UI 辅助色 /////////////////////////////////////////////////////////////////////////////
    $element_success    : "#67C23A",     //    成功 - 绿色
    $element_warning    : "#E6A23C",     //    警告 - 橙色
    $element_danger     : "#F56C6C",     //    危险 - 红色
    $element_info       : "#909399",     //    信息 - 灰色

    // 3.Element-UI 中性色 /////////////////////////////////////////////////////////////////////////////
    $element_black1     : "#303133",     //    主要文字
    $element_black2     : "#606266",     //    常规文字
    $element_black3     : "#909399",     //    次要文字
    $element_black4     : "#C0C4CC",     //    占位文字

    $element_grey1      : "#DCDFE6",     //    一级边框
    $element_grey2      : "#E4E7ED",     //    二级边框
    $element_grey3      : "#EBEEF5",     //    三级边框
    $element_grey4      : "#F2F6FC",     //    四级边框

    // 4.灰阶 //////////////////////////////////////////////////////////////////////////////////////////
    $black03            : "#f7f7f7",
    $black05            : "#f2f2f2",
    $black10            : "#e5e5e5",
    $black20            : "#cccccc",
    $black30            : "#b3b3b3",
    $black40            : "#999999",
    $black50            : "#7f7f7f",
    $black60            : "#666666",
    $black70            : "#4d4d4d",
    $black80            : "#333333",
    $black90            : "#1a1a1a",

    // 5.阴影 //////////////////////////////////////////////////////////////////////////////////////////
    $shadow03           : "rgba(0, 0, 0, 0.03)",
    $shadow04           : "rgba(0, 0, 0, 0.04)",
    $shadow07           : "rgba(0, 0, 0, 0.07)",
    $shadow08           : "rgba(0, 0, 0, 0.08)",
    $shadow10           : "rgba(0, 0, 0, 0.1)",
    $shadow20           : "rgba(0, 0, 0, 0.2)",
    $shadow30           : "rgba(0, 0, 0, 0.3)",
    $shadow40           : "rgba(0, 0, 0, 0.4)",
    $shadow50           : "rgba(0, 0, 0, 0.5)",
    $shadow60           : "rgba(0, 0, 0, 0.6)",
    $shadow70           : "rgba(0, 0, 0, 0.7)",
    $shadow80           : "rgba(0, 0, 0, 0.8)",
    $shadow90           : "rgba(0, 0, 0, 0.9)",

    // 5.白雾 //////////////////////////////////////////////////////////////////////////////////////////
    $fog03           : "rgba(255, 255, 255, 0.03)",
    $fog04           : "rgba(255, 255, 255, 0.04)",
    $fog10           : "rgba(255, 255, 255, 0.1)",
    $fog20           : "rgba(255, 255, 255, 0.2)",
    $fog30           : "rgba(255, 255, 255, 0.3)",
    $fog40           : "rgba(255, 255, 255, 0.4)",
    $fog50           : "rgba(255, 255, 255, 0.5)",
    $fog60           : "rgba(255, 255, 255, 0.6)",
    $fog70           : "rgba(255, 255, 255, 0.7)",
    $fog80           : "rgba(255, 255, 255, 0.8)",
    $fog90           : "rgba(255, 255, 255, 0.9)",

    // 6.填充色 ////////////////////////////////////////////////////////////////////////////////////////

    /*
        方案：
            Flat UI Colors - Chinese Palette
        备注：
            标记有 -my的是我自己的配色
        【！！！修改：
            色彩方案采用ant'd 官方方案
        】
    */

    // 红 ----------------------------------------------------------------------------------------------
    $color_watermelon   : "#ff4757",    //    西瓜（红）
    $color_tomato       : "#ff6348",    //    番茄（柔红）
    $color_rouge        : "#ff6b81",    //    胭脂（粉）
    // 黄 ----------------------------------------------------------------------------------------------
    $color_orange       : "#ffa502",    //    橙（橙）
    $color_coral        : "#ff7f50",    //    珊瑚（橘）
    $color_sand         : "#eccc68",    //    沙（淡黄）
    // 蓝 ----------------------------------------------------------------------------------------------
    $color_blue         : "#3742fa",    //    正/宝（蓝）
    $color_lake         : "#1e90ff",    //    湖（蓝）
    $color_rain         : "#5352ed",    //    雨（蓝）
    $color_sky          : "#70a1ff",    //    晴天（蓝）
    // 绿 ----------------------------------------------------------------------------------------------
    $color_grass        : "#99cc33",    //    草（土绿） -my
    $color_leaf         : "#2ed573",    //    叶（柔绿）
    $color_lemon        : "#7bed9f",    //    柠檬（浅绿）
    // 灰 ----------------------------------------------------------------------------------------------
    $color_lightsmoke   : "#f7f7f7",    //    轻烟（淡灰） -my 这个颜色其实就是black03
    //
    //
    //
    //
    //
    // Dust Red / 薄暮 斗志、奔放 -----------------------------------------------------------------------
    $red10              : "#fff1f0",
    $red20              : "#ffccc7",
    $red30              : "#ffa39e",
    $red40              : "#ff7875",
    $red50              : "#ff4d4f",
    $red60              : "#f5222d",
    $red70              : "#cf1322",
    $red80              : "#a8071a",
    $red90              : "#820014",
    $red100             : "#5c0011",
    // Volcano / 火山 醒目、澎湃 ------------------------------------------------------------------------
    $volcano10          : "#fff2e8",
    $volcano20          : "#ffd8bf",
    $volcano30          : "#ffbb96",
    $volcano40          : "#ff9c6e",
    $volcano50          : "#ff7a45",
    $volcano60          : "#fa541c",
    $volcano70          : "#d4380d",
    $volcano80          : "#ad2102",
    $volcano90          : "#871400",
    $volcano100         : "#610b00",
    // Sunset Orange / 日暮 温暖、欢快 ------------------------------------------------------------------
    $orange10           : "#fff7e6",
    $orange20           : "#ffe7ba",
    $orange30           : "#ffd591",
    $orange40           : "#ffc069",
    $orange50           : "#ffa940",
    $orange60           : "#fa8c16",
    $orange70           : "#d46b08",
    $orange80           : "#ad4e00",
    $orange90           : "#873800",
    $orange100          : "#612500",
    // Calendula Gold / 金盏花 活力、积极 ---------------------------------------------------------------
    $gold10             : "#fffbe6",
    $gold20             : "#fff1b8",
    $gold30             : "#ffe58f",
    $gold40             : "#ffd666",
    $gold50             : "#ffc53d",
    $gold60             : "#faad14",
    $gold70             : "#d48806",
    $gold80             : "#ad6800",
    $gold90             : "#874d00",
    $gold100            : "#613400",
    // Sunrise Yellow / 日出 出生、阳光 -----------------------------------------------------------------
    $yellow10           : "#feffe6",
    $yellow20           : "#ffffb8",
    $yellow30           : "#fffb8f",
    $yellow40           : "#fff566",
    $yellow50           : "#ffec3d",
    $yellow60           : "#fadb14",
    $yellow70           : "#d4b106",
    $yellow80           : "#ad8b00",
    $yellow90           : "#876800",
    $yellow100          : "#614700",
    // Lime / 青柠 自然、生机 ---------------------------------------------------------------------------
    $lime10             : "#fcffe6",
    $lime20             : "#f4ffb8",
    $lime30             : "#eaff8f",
    $lime40             : "#d3f261",
    $lime50             : "#bae637",
    $lime60             : "#a0d911",
    $lime70             : "#7cb305",
    $lime80             : "#5b8c00",
    $lime90             : "#3f6600",
    $lime100            : "#254000",
    // Polar Green / 极光绿 健康、创新 ------------------------------------------------------------------
    $green10            : "#f6ffed",
    $green20            : "#d9f7be",
    $green30            : "#b7eb8f",
    $green40            : "#95de64",
    $green50            : "#73d13d",
    $green60            : "#52c41a",
    $green70            : "#389e0d",
    $green80            : "#237804",
    $green90            : "#135200",
    $green100           : "#092b00",
    // Cyan / 明青 希望、坚强 ---------------------------------------------------------------------------
    $cyan10             : "#e6fffb",
    $cyan20             : "#b5f5ec",
    $cyan30             : "#87e8de",
    $cyan40             : "#5cdbd3",
    $cyan50             : "#36cfc9",
    $cyan60             : "#13c2c2",
    $cyan70             : "#08979c",
    $cyan80             : "#006d75",
    $cyan90             : "#00474f",
    $cyan100            : "#002329",
    // Daybreak Blue / 拂晓蓝 包容、科技、普惠 -----------------------------------------------------------
    $blue10             : "#e6f7ff",
    $blue20             : "#bae7ff",
    $blue30             : "#91d5ff",
    $blue40             : "#69c0ff",
    $blue50             : "#40a9ff",
    $blue60             : "#1890ff",
    $blue70             : "#096dd9",
    $blue80             : "#0050b3",
    $blue90             : "#003a8c",
    $blue100            : "#002766",
    // Geek Blue / 极客蓝 探索、钻研 --------------------------------------------------------------------
    $geekblue10         : "#f0f5ff",
    $geekblue20         : "#d6e4ff",
    $geekblue30         : "#adc6ff",
    $geekblue40         : "#85a5ff",
    $geekblue50         : "#597ef7",
    $geekblue60         : "#2f54eb",
    $geekblue70         : "#1d39c4",
    $geekblue80         : "#10239e",
    $geekblue90         : "#061178",
    $geekblue100        : "#030852",
    // Golden Purple / 酱紫 优雅、浪漫 ------------------------------------------------------------------
    $purple10           : "#f9f0ff",
    $purple20           : "#efdbff",
    $purple30           : "#d3adf7",
    $purple40           : "#b37feb",
    $purple50           : "#9254de",
    $purple60           : "#722ed1",
    $purple70           : "#531dab",
    $purple80           : "#391085",
    $purple90           : "#22075e",
    $purple100          : "#120338",
    // Magenta / 法式洋红 明快、感性 --------------------------------------------------------------------
    $magenta10          : "#fff0f6",
    $magenta20          : "#ffd6e7",
    $magenta30          : "#ffadd2",
    $magenta40          : "#ff85c0",
    $magenta50          : "#f759ab",
    $magenta60          : "#eb2f96",
    $magenta70          : "#c41d7f",
    $magenta80          : "#9e1068",
    $magenta90          : "#780650",
    $magenta100         : "#520339",


};

//
